// newstr.cpp
// использование оператора new дл€ выделени€ пам€ти под строку 


#include <iostream> 
#include <string>  // дл€ strcpy(), и т.д. 
using namespace std; 

/////////////////////////////////////////////////////////// 440___________________________√лава _1_0_. _”_к_а_з_а_тели______________________________

class String
{
private:
    char * str; // указатель на строку
public:
	String(char s[8]) // конструктор с одним параметром
	{
		int length = strlen(s); // вычисл€ем длину строки
		str = new char[length + 1]; // выдел€ем необходимую пам€ть
		strcpy(str, s); // копируем строку
		delete s; // удал€ем пам€ть которую выдеет конструктор на аргумент, а удаление пам€ти на указатель str произойдет в деструкторе 
	}
	~String() // деструктор
	{
		cout << "”дал€ем строку\n";
		delete[] str; // освобождаем пам€ть указател€ str
	}
	void display() // покажем строку на экране
	{
		cout << str << endl;
	}
};

///////////////////////////////////////////////////////////
int main()
{
    String s1("Welcome");
	cout << "s1 = ";
	s1.display();
	return 0;
}