//fahren.cpp
#include <iostream>

using namespace std;
int main()
{
	int f_temp; // create identificator "f_temp"
	cout << "Input Farenheit Temperature: ";  // output ""
	cin >> f_temp;  //input f_temp;
	
	int c_temp = (f_temp - 32) * 5 / 9; //  type c_temp and formule;
	cout << "C^ Temperature = " << c_temp << endl; // output C^ ''
	
	return 0;
}
// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку
// Советы по началу работы  
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
